Repository: gregsdennis/json-everything
Catalog: JsonSchema/Localization/Resources.*.resx
Languages: nb_no

# Error_Const
source: Expected [[value]]
nb_no: Forventet [[value]]

# Error_ContainsTooFew
source: Value should contain at least [[minimum]] matching items
nb_no: Verdi inneholder mindre enn [[minimum]] matchende elementer

# Error_ContainsTooMany
source: Value should contain no more than [[maximum]] matching items
nb_no: Verdi inneholder mer enn [[maximum]] matchende elementer

# Error_DependentRequired
source: Some required property dependencies are missing: [[missing]]
nb_no: Noen avhengihetsforhold mangler: [[missing]]

# Error_DependentSchemas
source: Some properties failed their dependent schemas: [[failed]]
nb_no: Følgende attributter feiler nødvendige felter : [[failed]]

# Error_Enum
source: Value should match one of the values specified by the enum
nb_no: Forventet verdi som skal matche en av verdiene i oppregning

# Error_ExclusiveMaximum
source: [[received]] should be less than [[limit]]
nb_no: [[received]] er ikke større enn [[limit]]

# Error_ExclusiveMinimum
source: [[received]] shoudl be greater than [[limit]]
nb_no: [[received]] er ikke mindre enn [[limit]]

# Error_FalseSchema
source: All values fail against the false schema
nb_no: Alle verdier feiler mot det falske skjema

# Error_Format
source: Value does not match format [[format]]
nb_no: Verdi matcher ikke formatet [[format]]

# Error_FormatWithDetail
source: Value does not match format [[format]]: [[detail]]
nb_no: Verdi matcher ikke formatet [[format]]: [[detail]]

# Error_Maximum
source: [[received]] should be at most [[limit]]
nb_no: [[received]] er større eller lik som [[limit]]

# Error_MaxItems
source: Value should have at most [[limit]] items
nb_no: Verdi har mer enn [[limit]] elemeter

# Error_MaxLength
source: Value should be at most [[limit]] characters
nb_no: Verdi er ikke kortere eller lik [[limit]] tegn

# Error_MaxProperties
source: Value should have at most [[limit]] properties
nb_no: Verdi har mer enn [[limit]] attributter

# Error_MetaSchemaValidation
source: Cannot validate current schema against meta-schema [[uri]]
nb_no: Kan ikke validere nåværende skjema mot meta-skjema [[uri]]

# Error_Minimum
source: [[received]] should be at least [[limit]]
nb_no: Verdi har mindre enn [[limit]] elementer

# Error_MinItems
source: Value should have at least [[limit]] items
nb_no: Value has fewer than [[limit]] items

# Error_MinLength
source: Value should be at least [[limit]] characters
nb_no: Verdi er ikke lengre eller lik som [[limit]] tegn

# Error_MinProperties
source: Value should have at least [[limit]] properties
nb_no: Verdi har mindre enn [[limit]] attributter

# Error_MultipleOf
source: [[received]] should be a multiple of [[divisor]]
nb_no: [[received]] er ikke en multippel av [[divisor]]

# Error_OneOf
source: Expected 1 matching subschema but found [[count]]
nb_no: Forventet 1 matchende subskjema men fant [[count]]

# Error_Pattern
source: The string value is not a match for the indicated regular expression
nb_no: Verdi i strengen matcher ikke det vanlige utrykket

# Error_Required
source: Required properties [[missing]] are not present
nb_no: Nødvendige attributter [[missing]] mangler

# Error_Type
source: Value is [[received]] but should be [[expected]]
nb_no: Verdi er [[received]] men burde være [[expected]]

# Error_UniqueItems
source: Found duplicates at the following index pairs: [[duplicates]]
nb_no: Duplikater funnet ved følgende index par: [[duplicates]]

# Error_UnknownFormat
source: Cannot validate unknown format [[format]]
nb_no: Kan ikke validere ukjent format [[format]]

# Error_UnknownVocabularies
source: Validator does not know about these required vocabularies: [[vocabs]]
nb_no: Valideringen kjenner ikke til nødvendige vokabular: [[vocabs]]
